[
    {
        "id":"1",
        "image":"https://thebloodconnection.org/wp-content/uploads/2023/08/Universal-Blood-Donors.jpg",
    "title":"Universal Blood Donors",
    "date":"May 22, 2023",
    "description":"In an emergency situation that requires a blood transfusion, time is of the essence. As precious moments tick by, there’s not a minute to waste, and oftentimes, medical providers that are caring for patients reach for the blood that they know will help complete a successful transfusion — type O-negative (O-). Type O-negative is a really special kind of blood because it is the Universal Donor to all blood types. In this blog, we will take a closer look at O- and get into the nitty-gritty of what makes it so precious in the medical community. ",
    "title1":"Why Type O-Negative Blood is Important",
    "description1":"Because O-negative blood is the Universal Donor, it is often in high demand at hospitals and blood banks. In an emergency situation, when someone needs blood quickly, it’s not always possible to know the patient’s blood type. Ideally, transfusions are done with a recipient’s exact blood type — and even then, the donor’s and recipient’s blood are mixed to check compatibility in a process called crossmatching. However, clinicians don’t always have the luxury of time. When there’s not a moment to lose, type O-negative blood is usually the best option for an emergency transfusion. Outside of emergency situations, O-negative blood is also the safest bet for newborns who have deficiencies and need transfusions. Even the littlest recipients can benefit from Universal Donor blood! (and PS – The Blood Connection also collects blood specifically for babies!)",
    "title2":"Schedule a Donation Today",
    "description2":"Do you know your blood type? You might have that incredible O-negative blood flowing through your veins and not even know it! Only 7% of the population has O-negative blood. However, no matter your blood type, giving blood is an important and selfless thing to do. You can save up to three lives with each donation!If you’re interested in knowing your blood type and donating blood, contact The Blood Connection or visit our website at thebloodconnection.com. We’d be happy to talk with you and tell you about the amazing things that giving blood can do for your community!"
}
]