[
    {
        "id":"1",
        "image":"https://thebloodconnection.org/wp-content/uploads/2023/08/Universal-Blood-Donors.jpg",
    "title":"Universal Blood Donors",
    "date":"May 22, 2023",
    "description":"O-negative (O-) blood is considered invaluable in emergency situations because it is universally compatible with all blood types. This compatibility ensures that O-negative blood can be safely transfused to patients with any blood type, regardless of their ABO and RhD blood group, without the risk of adverse reactions. ",
    "title1":"Why Type O-Negative Blood is Important",
    "description1":"Because O-negative blood is the Universal Donor, it is often in high demand at hospitals and blood banks. In an emergency situation, when someone needs blood quickly, it’s not always possible to know the patient’s blood type. Ideally, transfusions are done with a recipient’s exact blood type — and even then, the donor’s and recipient’s blood are mixed to check compatibility in a process called crossmatching. However, clinicians don’t always have the luxury of time. When there’s not a moment to lose, type O-negative blood is usually the best option for an emergency transfusion. Outside of emergency situations, O-negative blood is also the safest bet for newborns who have deficiencies and need transfusions. Even the littlest recipients can benefit from Universal Donor blood! (and PS – The Blood Connection also collects blood specifically for babies!)",
    "title2":"Schedule a Donation Today",
    "description2":"Do you know your blood type? You might have that incredible O-negative blood flowing through your veins and not even know it! Only 7% of the population has O-negative blood. However, no matter your blood type, giving blood is an important and selfless thing to do. You can save up to three lives with each donation!If you’re interested in knowing your blood type and donating blood, contact The Blood Connection or visit our website at thebloodconnection.com. We’d be happy to talk with you and tell you about the amazing things that giving blood can do for your community!"
},

{
    "id":"2",
    "image":"https://thebloodconnection.org/wp-content/uploads/2023/08/TBC-May-blogs-Blood-Type-Facts.jpg",
"title":"Blood Type Facts",
"date":"May 8, 2023",
"description":"Approximately 33% of Americans are unaware of their blood type, yet this knowledge can be crucial in emergencies. Understanding your blood type, its unique characteristics, and why it matters for transfusions is essential. Discover more about blood types, their differences.",
"description1":"Blood types must be matched very specifically for recipients to have a safe transfusion. Incompatible blood can trigger the body’s immune system to fight the donated blood, which can cause serious or even life-threatening complications.A and B antigens and the Rh proteins must all be taken into consideration for appropriate blood transfusions. Rh-negative patients can only receive blood that is Rh-negative, while Rh-positive patients can receive either Rh-positive or negative blood. There are a couple of special blood types to keep in mind with transfusions, and these are Type O- and Type AB+. Those with Type AB+ are called universal recipients, meaning that they can receive any blood type during a transfusion. Type O- blood is the universal donor, so it can be given to those with any other blood type. Because type O- is universally received, it is often in short supply in blood banks. Blood banks and hospitals don’t want to rely on Type O- blood for every transfusion, which is why it is crucial for all blood types to donate! Yes, even common blood types are encouraged to donate as often as they can — as these common types are the ones most often needed in transfusions. ",
"title2":"How Blood Types Are Determined",
"description2":"In a majority of the population, there are four major blood groups that are determined by the presence or absence of two antigens, A and B. Antigens are protein molecules found on the surface of red blood cells whose purpose is to identify foreign substances in the body, such as bacteria or viruses, and alert the body’s immune system to destroy them. Each blood group has a different composition of these antigens:"
},

{
    "id":"3",
    "image":"https://thebloodconnection.org/wp-content/uploads/2023/04/TBC23-Diabetes-Donation-Blog-Image.jpg",
"title":"Donating Blood and Diabetes",
"date":"Apr 12, 2023",
"description":"Despite the constant need for blood donations, only 3% of eligible Americans donate each year. Many potential donors, including those with diabetes, are unsure of their eligibility due to diabetes's impact on blood. The good news is that individuals with diabetes can often donate blood. ",
"title1":"Can people with diabetes give blood?",
"description1":"If you are in generally good health and your diabetes is well-managed – then yes, you can give blood! It doesn’t matter if you have Type 1 or Type 2; as long as the diabetes is under control, you are an eligible donor. Congratulations!Although having diabetes doesn’t automatically disqualify a potential donor, it is still a good idea to check with your doctor before donating. It is crucial to ensure that your blood glucose level is within the target range set by your medical provider, as blood with too much sugar does not store well. If you have a doctor’s appointment in the days following your donation, it’s important to let your physician know that you’ve recently given blood. Some people with Type 1 diabetes report slightly elevated blood glucose levels 3-5 days after donating. Donating can also cause A1c or HbA1c levels to be falsely lowered. This is likely due to the temporary loss of blood volume and accelerated red blood cell turnover following a donation. It’s also worth noting that the type of medication you take to manage your diabetes won’t disqualify you from donating blood. Whether you take insulin injections or oral medications, you are still eligible to give blood as long as a qualified health professional prescribes the medicine and it helps keep your condition under control. ",
"title2":"Blood donation tips for diabetics",
"description2":"(1)Check your blood glucose levels regularly in the days leading up to your appointment.(2)Drink extra water on the day of your donation to avoid dehydration and feeling unwell.(3)Follow a healthy diet that keeps your diabetes under control, especially if your doctor recommends it.(4)Get ready to become a lifesaver!"
},

{
    "id":"4",
    "image":"https://thebloodconnection.org/wp-content/uploads/2023/04/TBC23_CancerSurvivors_BlogImage2.jpg",
"title":"Blood Donation and Cancer",
"date":"Apr 12, 2023",
"description":"Cancer patients, unfortunately, are generally unable to donate blood. This is due to the potential risk of transmitting cancer cells or compromising their weakened immune systems. Donor eligibility criteria typically require individuals to be cancer-free for a specific period. ",
"description1":"The short answer here is no, cancer patients cannot give blood until they’re in remission, no matter what type of cancer it is. Why? This precaution is for the safety of both cancer patients and potential blood recipients. Although the chance is very low, it is possible that a blood transfusion recipient with a weakened immune system might not be able to fight off the cancer cells (if present) in the blood they receive. Because of this possibility, cancer patients are not eligible to donate blood — but they may be able to in the future when they are in remission.",
"title2":"Can cancer survivors donate blood?",
"description2":"Yes! Most cancer survivors are eligible to donate blood. If the cancer has been successfully treated and it has been 12+ months since the last treatment was completed, cancer survivors can be blood donors. It’s important to note, however, this waiting period isn’t required for all cancer survivors. Those who have had lower-risk cancers such as squamous or basal cell cancers can donate if the cancer has been removed and healed completely — no 12-month waiting period is required. ",
"title3":"Blood Transfusions in Cancer Treatment",
"description3":"Blood donations play a critical role in the treatment and recovery of cancer patients. In fact, 25% of the nation’s blood supply goes to help cancer patients for  life-saving treatments. Many cancer patients, especially those undergoing chemotherapy, need regular blood transfusions to lessen the unpleasant side effects of treatments and improve their quality of life. Since cancers of the blood affect blood production the most, patients with these cancers are most in need of blood transfusions. Transfusions reduce the risk of complications that can come with a low cell count, and they also give the body healthy blood cells that it’s not producing on its own. "
},

{
    "id":"5",
    "image":"https://thebloodconnection.org/wp-content/uploads/2023/08/What-Men-Need-to-Know-About-Giving-Blood.jpg",
"title":"What Men Need to Know About Giving Blood",
"date":"Mar 27, 2023",
"description":"People have a lot of questions about donating blood. Will donating blood make me sick. Can I give blood if I’m a vegetarian. Can I donate if I’m on [insert medication here]?",
"description1":"Many men wonder if giving blood will lower their testosterone levels – and the answer here is simple: Nope, it won’t long term. There are no associations between blood donation and lower testosterone levels. That being said, if testosterone levels are a concern, we certainly recommend following up with a physician.",
"title2":"Does giving blood impact cardiovascular health?",
"description2":"While cardiovascular events are scary for both men and women, men tend to be at a higher risk. How much higher? Between 70% and 89% of sudden heart attacks happen in men. There are numerous reasons why this is the case, but the fact remains that heart health is important, and one surprising way that men (and women) can improve their cardiovascular health is by giving blood regularly. Why is that? Good question.Donating blood reduces blood viscosity. Blood viscosity can be a reliable predictor of a cardiovascular event in a patient. The thicker and stickier blood is, the more friction there is in blood vessels. This friction can cause damage and contribute to the possibility of a cardiovascular event. Giving blood can reduce the viscosity of a patient’s blood, reducing the potential damage to their blood vessels. ",
"title3":"Can donating blood burn calories?",
"description3":"Did you know donating blood will burn calories? Yep, it’s true! A study from the University of California San Diego found that blood donors burn an average of 650 calories per session. While this is something that both men and women can benefit from, men may especially be interested in burning a few extra calories as statistics show that men tend to be more overweight than women — 33% of men compared to 25% of women.Of course, giving blood shouldn’t be the only tool people use to burn calories for weight loss."
},

{
    "id":"6",
    "image":"https://thebloodconnection.org/wp-content/uploads/2023/08/TBC-March-blogs-What-Women-Need-to-Know-About-Giving-Blood.jpg",
"title":"What Women Need to Know About Giving Blood",
"date":"Mar 13, 2023",
"description":"Empower your community through blood donation – each contribution saves up to three lives regardless of age, gender, or race. We're immensely thankful for our donors.",
"title1":"Can women donate blood while pregnant?",
"description1":"Many of our regular female donors are curious if they can continue giving blood if they are expecting a child. As much as we appreciate their desire to donate, the answer is no.Pregnant women need to focus on keeping their babies healthy, and donating blood is counteractive to this goal. The body needs blood and iron to support the fetus during pregnancy, and a lack of iron and nutrients after giving blood can increase the risk of complications like anemia. It can also compromise the health of the mother and the baby. The average woman needs 350-500 more milligrams of iron while pregnant to prevent an iron deficiency, so that’s why pregnant women cannot give blood. So, when can expectant mothers give blood again? The FDA recommends waiting six weeks after giving birth, which allows the woman time to heal and recover from pregnancy and delivery. Consulting a physician is best before giving blood again.",
"title2":"Can women donate blood while menstruating?",
"description2":"Due to the nature of a period, it’s only natural to wonder whether or not it’s a good idea to give blood while menstruating. The good news is, yes, women can give blood while menstruating. Of course, if you are experiencing a particularly heavy cycle, waiting until your period is over may be best, as giving blood could cause your iron levels to drop. This temporary drop could make you feel fatigued after your donation or could make you ineligible at the time. We want all of our donors to have a rewarding experience, and there’s no shame in waiting another week or two to donate just to be safe.As with any other donor, women must meet a few other requirements before giving blood. Donors must be at least 17 years old (or 16 years old with the permission of a parent or guardian, 16 and 17 with parental consent in North Carolina), weigh at least 110 pounds, and be in generally good health. As a general rule, potential donors" 
},

{
    "id":"7",
    "image":"https://thebloodconnection.org/wp-content/uploads/2023/08/TBC-February-blogs-Blood-Donations-Colds-Viruses-and-COVID-19_-The-Complete-Guide.jpg",
"title":"COVID-19 & Blood Donation",
"date":"Mar 13, 2023",
"description":"There are a lot of questions out there regarding blood donations and what factors make someone eligible or ineligible to donate. During the cold and flu season, many of these questions relate to — you guessed it — colds, flu, and COVID-19.",
"title1":"Can You Donate Blood If You Have a Cold or the Flu?",
"description1":"Simply put — no. You should not donate blood if you are sick with a cold or the flu. This is for your safety. If you’ve scheduled an appointment to give blood and realize you’re not feeling well the day of your donation, it is best to reschedule that appointment. A good rule of thumb is that you should be symptom-free for at least 48 hours prior to your donation. Make sure you’re not running a fever or experiencing cold- or flu-related symptoms such as coughing, sneezing, sniffles, or fatigue. Why is it so important to stay well before donating blood? Your body relies on your blood to fight sickness, so it’s always a bad idea to give blood while your immune system is compromised. Donating blood while sick can further compromise your immunity, perpetuate cold and flu symptoms, and even make those symptoms worse. In extreme cases, you could even develop pneumonia. With this precaution in mind, it’s important to remember that while donating blood can overwhelm an already compromised immune system, it will not make you sick if you are already feeling well. A healthy body will recover quickly after donating blood. ",
"title2":"What About Donating Blood After a Flu Shot?",
"description2":"Getting the flu is likely not on your annual to-do list, so getting a flu shot every year is a good idea. If you are worried that getting a flu vaccine will affect your blood donation eligibility, don’t be. As long as you feel well, it is perfectly fine to donate blood after receiving a flu shot — even if it’s on the same day! " ,
"title3":"Blood Transfusions in Cancer Treatment"
}

]