{
    "pune": [
        {
  
            "imgEvent": "https://csrbox.org/company/proj_img/1520509436blood-donation.jpg",
            
         
            "date": "(5th Octomber 2023)",
            "title": "SMT KASHIBAI NAVALE GENERAL HOSPITAL BLOOD CENTER ",
            "description": "A blood donation camp will be held at STES Campus in Ambegaon, Pune. You can contact them at 9923056961 for more details. The camp is being organized by the Smt. Kashibai Navale General Hospital Blood Centre and conducted by Dr. Sudhir Chavan. The camp is scheduled to take place from 09:00 AM to 04:00 PM. Donating blood is a noble act that can help save lives, so if you're interested, please consider participating in this event."
        },
        {
            "img": "https://www.redcrossmaharashtra.org/gallery-img/Dental%20check%20up%20Arvi%209.9.23.jpeg",
            "title": "FIRST AID DAY CELEBRATED ON 9TH SEPTEMBER 2023",
            "date": "(9th september 2023)",
            "imgEvent": "https://www.redcrossmaharashtra.org/gallery-img/First%20Aid%20Garware%20College%20Pune%209.9.23.jpeg",
            "description": "On the occasion of 'First Aid Day' IRCS Pune District Branch organised First Aid and CPR awareness program at Modern College, Ganeshkhind and Garware College of Commerce (Jr.College) on 9th September 2023. Dr Naresh Munot, Dr. Rajkumar Shah and Mrs. Alka Dalvi imparted the training. Total 100 students along with teaching staff participated."
         
        },
        {
      
            "title": "MOBILE BLOOD COLLECTION VAN HANDED OVER FOR OPERATIONAL PURPOSES TO RAJARSHI SHAHU BLOOD CENTRE",
            "imgEvent": "https://www.redcrossmaharashtra.org/gallery-img/Kolhapur%20Blood%20Collection%20Van%2026-8-23.jpeg",
            "date": "(26th August 2023)",
    
            "description": "Rajarshi Shahu Blood Centre, Kolhapur is jointly run by IRCS Kolhapur District Branch & Rotary Samaj Seva Kendra, Kolhapur.Mobile Blood Collection Van donated by IFRC through IRCS National Headquarters, New Delhi & facilitated by IRCS Maharashtra State Branch to Kolhapur Red Cross was handed over for operational purposes to Rajarshi Shahu Blood Centre under the direct supervision/control & ownership of Kolhapur Red Cross Branch. Hon'ble Member of Parliament Shri Sharad Pawar Ji was the Chief Guest during the ceremony on 26th August, 2023. Kolhapur Red Cross Branch managing committee members, staff & Rajarshi Shahu Blood Centre staff were present on the occasion."
          
     
        },
        {
           
            "title": "SANE GURUJI AROGYA KENDRA IN HADAPSAR",
            "date": "(2nd March 2023)",
            "imgEvent": "https://images.hindustantimes.com/rf/image_size_640x362/HT/p2/2016/06/14/Pictures/blood-donation-camp-at-iehe_06c40a76-322c-11e6-a1a7-3aade94c5b51.jpg",
            "description": "A blood donation camp is scheduled for the 2nd of March, 2023, at Sane Guruji Arogya Kendra in Hadapsar. The camp aims to support and collect blood donations for a total of 69 patients in need. Participating in blood donation events like this one can make a significant difference in saving lives, so if you're available, consider joining and contributing to this important cause."
     
        }
      
    ],
    "nagpur": [
        {
  
            "imgEvent": "https://sdmit.in/wp-content/uploads/2019/04/Blood-donation_1-min.jpg",
      
         
            "date": "(24th September 2022)",
            "title": "FREE COVID-19 BOOSTER DOSE DRIVE IN NAGPUR",
            "description": "On 24th September 2022 a Free Covid-19 Booster Dose drive organised by Indian Red Cross Society, Nagpur District Branch in collaboration with Nagpur Municipal Corporation"
        },
        {
            "img": "https://assets.telegraphindia.com/telegraph/2020/Sep/1600627511_21metblood_5col-3.jpg",
            "title": "Akhil Bhartiya Marwadi Yuva Manch,Hinganghat",
            "date": "(02-Oct-2023)",
            "imgEvent": "https://www.5dariyanews.com/Uploads/2020/06/26/en-news-18532348-Blood-Donation-Camp-at,-Police-Line-Gulshan-Ground,-Jammu-26.jpg",
            "description": "Akhil Bhartiya Marwadi Yuva Manch, Hinganghat, recently organized a blood donation camp in collaboration with Lifeline Blood Centre, Nagpur. The event took place at Arihant Critical Care, Hinganghat, Nagpur, and was spearheaded by Poonam Goyanka. The camp aimed to encourage voluntary blood donation and was held from 11:00 AM to 6:00 PM. Participants and donors could contact 9763428578 for more information. This initiative exemplifies the commitment of the Marwadi Yuva Manch to contribute to the well-being of the community by facilitating access to life-saving blood donations"
         
        },
        {
      
            "title": "Megha Blood Donation Camp",
            "imgEvent": "https://bhubaneswarcuttackpolice.gov.in/wp-content/uploads/2022/02/1-11.jpg",
            "date": "(26th January 2023)",
    
            "description": "The Megha Blood Donation Camp will be held at Uday School Ground, Antuji Nagar, Bhandewadi, Pardi, Nagpur, Nagpur, Nagpur. This camp is conducted by the Daga Memorial Women Govt Hospital Blood Centre and organized by Dhanraj Vadichar. The camp's timing is from 09:00 to 15:00. It provides an opportunity for individuals to come forward and contribute to the noble cause of blood donation, which plays a critical role in saving lives and addressing the ongoing shortage of blood supply in the region."
          
        },
        {
           
            "title": "HANUMAN MANDIR KANHAN ",
            "date": "(15th april 2023)",
            "imgEvent": "https://assets.telegraphindia.com/telegraph/2020/Sep/1600627511_21metblood_5col-3.jpg",
            "description": "HANUMAN MANDIR KANHAN, located in Kanhan, Nagpur, is the venue for an upcoming blood donation camp. This event is being conducted by the Dr. Hegdewar Blood Centre and organized by Yogesh. The camp will take place from 09:00 to 14:00, providing ample time for individuals to contribute to this noble cause. If you wish to participate or have any inquiries, you can contact the organizers at 9511858682. This initiative underscores the importance of community involvement and the critical need for blood donations to save lives. It's a commendable effort to promote health and well-being in the local community"
     
        }
      
    ],
    "dhule": [
        {
  
            "imgEvent": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcStMu0YsZ20Qx8cduYG8pAxlI9GDCkA42RQ5w&usqp=CAU",
      
         
            "date": "02-Oct-2023",
            "title": "Mega Blood Donation Camp",
            "description": "The Shri Bhausaheb Hire Government Medical College Hospital Blood Centre in Dhule, Maharashtra, is hosting a significant blood donation camp on a date to be specified. Organized by Sandra Rodriques, this camp is a crucial effort to collect much-needed blood donations. The event will run from 09:00 to 17:00, offering a broad window of opportunity for individuals to participate. For further information or to get involved, you can contact them at 9823924151. This initiative plays a vital role in saving lives and promoting community health in Dhule"
        },
        {
  
            "imgEvent": "https://baif.org.in/wp-content/uploads/2023/03/Boold-donation-2023-1.jpeg",
      
         
            "date": "15-sept-2023",
            "title": "parag kale Pravara Medical Trusts Blood Centre",
            "description": "the parag kale camp in AP Raytale Tal Parner Dist Dhule Dhule ishosting the blood camp this camp will conducted by Surabhi Hospital PvtLtd Surabhi Blood Centre and organized by Amit Sabale this camp time is 11:00 to 02:00 For further information or to get involved, you can contact them at 9823924151. This initiative plays a vital role in saving lives and promoting community health in Dhule."
        },
         {
  
            "imgEvent": "https://www.redcrossmaharashtra.org/gallery-img/Drawing%20competition%20prize.jpeg",
      
         
            "date": "(8th May 2023)",
            "title": "WORLD RED CROSS DAY CELEBRATED ON 8TH MAY, 2023",
            "description": "WORLD RED CROSS DAY CELEBRATED ON 8TH MAY, 2023 (8th May 2023) title Shree Arpan Blood Center, Dhule On 8th May 2023 on the occasion of World Red Cross Day prize distribution ceremony of drawing competition for various age groups which was organized on 2nd May 2023 was held. Chief Guest, CA Manoj Disa and office bearers of Red Cross Dhule were present"
        }
    ],
    "mumbai": [
        {
            "imgEvent":"https://mumbaicustomszone1.gov.in/writereaddata/images/Gallery/IMG20190212085806.jpg",
            "date": "(12th february 2019",
            "title": "BLOOD DONATION CAMP" ,
            "description": "On February 12, 2019, Mumbai Custom Zone-I collaborated with Saifee Hospital on Charni Road, Mumbai, for a significant event. This partnership aimed to promote a noble cause, although specific details about the event are not provided. Such collaborations often focus on community well-being and welfare, showcasing the importance of public-private cooperation for the greater good. "

        },
        {
            "imgEvent":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQmPVLSpOiLmHk0Xn4wLe1icsAnlyvNuUwd_A&usqp=CAU",
            "date":"(1st July 2023)",
            "title": " DOCTOR'S DAY CELEBRATED ON 1ST JULY 202",
            "description": "On 1st July 2023 on the occasion of Doctor’s Day a blood donation camp was organised by IRCS Chopda Sub-District Branch in association with the Indian Medical Association (IMA) Chopda. IMA President & Secretary also donated blood on this occasion. Also a blood donation camp was organised in association with General Practitioners Association, Chopda on 2nd July 2023. Total 25 units collected."
        }
      
    ]
}

